Best Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 462, 200)          4580600   
_________________________________________________________________
bidirectional (Bidirectional (None, 462, 512)          935936    
_________________________________________________________________
bidirectional_1 (Bidirection (None, 512)               1574912   
_________________________________________________________________
dense (Dense)                (None, 256)               131328    
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 257       
=================================================================
Total params: 7,223,033
Trainable params: 7,223,033
Non-trainable params: 0
_________________________________________________________________

Model Performance:
Accuracy: 0.6996996996996997
