Best Model Summary:
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 462, 200)          4580600   
_________________________________________________________________
gru (GRU)                    (None, 462, 256)          351744    
_________________________________________________________________
gru_1 (GRU)                  (None, 256)               394752    
_________________________________________________________________
dense (Dense)                (None, 256)               65792     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 257       
=================================================================
Total params: 5,393,145
Trainable params: 5,393,145
Non-trainable params: 0
_________________________________________________________________

Model Performance:
Accuracy: 0.6996996996996997
